RT-Thread/rt-thread/bsp/freescale/platform/system/src/clock/MK80F25615/fsl_clock_MK80F25615.h
/*!
 * @brief Get the the clock gate state for I2C module.
 *
 * This function will get the clock gate state for I2C module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool CLOCK_SYS_GetI2cGateCmd(uint32_t instance);

/*!
 * @brief Enable the clock for LPUART module.
 *
 * This function enables the clock for LPUART module.
 * @param instance module device instance
 */
void CLOCK_SYS_EnableLpuartClock(uint32_t instance);

/*!
 * @brief Disable the clock for LPUART module.
 *
 * This function disables the clock for LPUART module.
 * @param instance module device instance
 */
void CLOCK_SYS_DisableLpuartClock(uint32_t instance);

/*!
 * @brief Get the the clock gate state for LPUART module.
 *
 * This function will get the clock gate state for LPUART module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool CLOCK_SYS_GetLpuartGateCmd(uint32_t instance);

/*!
 * @brief Enable the clock for EMVSIM module.
 *
 * This function enables the clock for EMVSIM module.
 * @param instance module device instance
 */
void CLOCK_SYS_EnableEmvsimClock(uint32_t instance);

/*!
 * @brief Disable the clock for EMVSIM module.
 *
 * This function disables the clock for EMVSIM module.
 * @param instance module device instance
 */
void CLOCK_SYS_DisableEmvsimClock(uint32_t instance);

/*!
 * @brief Get the the clock gate state for EMVSIM module.
 *
 * This function will get the clock gate state for EMVSIM module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool CLOCK_SYS_GetEmvsimGateCmd(uint32_t instance);

/*!
 * @brief Enable the clock for QSPI module.
 *
 * This function enables the clock for QSPI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableQspiClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateQspi0);
}

/*!
 * @brief Disable the clock for QSPI module.
 *
 * This function disables the clock for QSPI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableQspiClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateQspi0);
}

/*!
 * @brief Get the the clock gate state for QSPI module.
 *
 * This function will get the clock gate state for QSPI module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetQspiGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateQspi0);
}

/*!
* @brief Enable the clock for FLEXIO module.
*
* This function enables the clock for FLEXIO module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_EnableFlexioClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateFlexio0);
}

/*!
* @brief Disable the clock for FLEXIO module.
*
* This function disables the clock for FLEXIO module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_DisableFlexioClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateFlexio0);
}

/*!
* @brief Get the clock gate state for FLEXIO module.
*
* This function will get the clock gate state for FLEXIO module.
* @param instance module device instance
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
static inline bool CLOCK_SYS_GetFlexioGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM,kSimClockGateFlexio0);
}

/*!
* @brief Enable the clock for TRNG module.
*
* This function enables the clock for TRNG module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_EnableTrngClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateTrng0);
}

/*!
* @brief Disable the clock for TRNG module.
*
* This function disables the clock for TRNG module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_DisableTrngClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateTrng0);
}

/*!
* @brief Get the clock gate state for TRNG module.
*
* This function will get the clock gate state for TRNG module.
* @param instance module device instance
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
static inline bool CLOCK_SYS_GetTrngGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM,kSimClockGateTrng0);
}

/*!
 * @brief Enable the clock for SDHC module.
 *
 * This function enables the clock for SDHC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableSdhcClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateSdhc0);
}

/*!
 * @brief Disable the clock for SDHC module.
 *
 * This function disables the clock for SDHC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableSdhcClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateSdhc0);
}

/*!
 * @brief Get the the clock gate state for SDHC module.
 *
 * This function will get the clock gate state for SDHC module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetSdhcGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateSdhc0);
}

/*!
 * @brief Enable the clock for TSI module.
 *
 * This function enables the clock for TSI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableTsiClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateTsi0);
}

/*!
 * @brief Disable the clock for TSI module.
 *
 * This function disables the clock for TSI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableTsiClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateTsi0);
}

/*!
 * @brief Get the the clock gate state for TSI module.
 *
 * This function will get the clock gate state for TSI module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetTsiGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateTsi0);
}

/*!
 * @brief Set the SDHC external clock frequency(SDHC_CLKIN).
 *
 * This function sets the SDHC external clock frequency (SDHC_CLKIN).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequcney value.
 */
static inline void CLOCK_SYS_SetSdhcExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < SDHC_EXT_CLK_COUNT);

    g_sdhcClkInFreq[srcInstance] = freq;
}

/*!
 * @brief Set the USB external clock frequency(USB_CLKIN).
 *
 * This function sets the USB external clock frequency (USB_CLKIN).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequcney value.
 */
static inline void CLOCK_SYS_SetUsbExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < USB_EXT_CLK_COUNT);

    g_usbClkInFreq[srcInstance] = freq;
}

/*!
 * @brief Set the FTM external clock frequency(FTM_CLKx).
 *
 * This function sets the FTM external clock frequency (FTM_CLKx).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequcney value.
 */
static inline void CLOCK_SYS_SetFtmExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < FTM_EXT_CLK_COUNT);

    g_ftmClkFreq[srcInstance] = freq;
}

#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @}*/

#endif /* __FSL_CLOCK_K80F25615_H__ */
/*******************************************************************************
 * EOF
 ******************************************************************************/

